Diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_НачалоДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ОкончаниеДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

Diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
//{ Левшина ВКМ_Диплом 

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	ВидДоговораПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВидДоговораПриИзмененииНаСервере()
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.АбонентскоеОбслуживание Тогда
		
		Элементы.ВКМ_НачалоДействияДоговора.Видимость = Истина; 
		Элементы.ВКМ_ОкончаниеДействияДоговора.Видимость = Истина;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Истина;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Истина;
		
	КонецЕсли;
	
	Если Объект.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.АбонентскоеОбслуживание Тогда
		
		Элементы.ВКМ_НачалоДействияДоговора.Видимость = Ложь; 
		Элементы.ВКМ_ОкончаниеДействияДоговора.Видимость = Ложь;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Если Объект.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.АбонентскоеОбслуживание Тогда
		
		Элементы.ВКМ_НачалоДействияДоговора.Видимость = Ложь; 
		Элементы.ВКМ_ОкончаниеДействияДоговора.Видимость = Ложь;
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = Ложь;
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = Ложь;
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДобавитьРеквизитПрограммно = Элементы.Добавить("ВКМ_НачалоДействияДоговора",Тип("ПолеФормы"));
	ДобавитьРеквизитПрограммно.ПутьКДанным = "Объект.ВКМ_НачалоДействияДоговора";
	ДобавитьРеквизитПрограммно.Вид = ВидПоляФормы.ПолеВвода;
	ДобавитьРеквизитПрограммно.Заголовок = "Начало действия договора";
	
	ДобавитьРеквизитПрограммно = Элементы.Добавить("ВКМ_ОкончаниеДействияДоговора",Тип("ПолеФормы"));
	ДобавитьРеквизитПрограммно.ПутьКДанным = "Объект.ВКМ_ОкончаниеДействияДоговора";
	ДобавитьРеквизитПрограммно.Вид = ВидПоляФормы.ПолеВвода;
	ДобавитьРеквизитПрограммно.Заголовок = "Окончание действия договора";
	
	ДобавитьРеквизитПрограммно = Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты",Тип("ПолеФормы"));
	ДобавитьРеквизитПрограммно.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	ДобавитьРеквизитПрограммно.Вид = ВидПоляФормы.ПолеВвода;
	ДобавитьРеквизитПрограммно.Заголовок = "Сумма абонентской платы";
	
	ДобавитьРеквизитПрограммно = Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы",Тип("ПолеФормы"));
	ДобавитьРеквизитПрограммно.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	ДобавитьРеквизитПрограммно.Вид = ВидПоляФормы.ПолеВвода;
	ДобавитьРеквизитПрограммно.Заголовок = "Стоимость часа работы"; 
	
КонецПроцедуры
 //{ Левшина ВКМ_Диплом
